app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "updated_at", "title", "content", "created_at") VALUES('Kumar', '2009-09-23 02:32:32', 'Peechara', 'Second post', '2009-09-23 02:32:32')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "content" = 'Second post of first day', "updated_at" = '2009-09-23 04:22:57' WHERE "id" = 2
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])